      ******************************************************************
      * Author:Jacob
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPORTE-NOMINA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT ARCHIVO-EMPLEADOS ASSIGN TO "../EMPLEADOS.DAT"
       ORGANIZATION IS LINE SEQUENTIAL.


       DATA DIVISION.
       FILE SECTION.
        FD   ARCHIVO-EMPLEADOS.
        01  REGISTRO-EMP.
        05 EMP-NUMERO PIC 9(05).
        05 EMP-NOMBRE PIC X(10).
        05 EMP-AP-PATERNO PIC X(15).
        05 EMP-AP-MATERNO PIC X(10).
        05 EMP-EDAD PIC 9(03).
        05 EMP-SEXO PIC X(02).
        05 EMP-UNI PIC X(12).
        05 EMP-PROFESION PIC X(15).
        05 EMP-EXPERIENCIA PIC 9(03).
        05 EMP-SALARIO-DIA PIC 9(04)V99.
        05 EMP-DIAS-TRAB PIC 9(02).

       WORKING-STORAGE SECTION.
      *BANDERA CLASICA PARA EL FIN DEL ARCHIVO (S= SI, N= NO)
        01 WS-FIN-ARCHIVO PIC X(01) VALUE "N".
      *CONTADORES SIMPLES
        01 WS-TOTAL-LEIDOS PIC 9(03) VALUE ZEROES.
        01 WS-TOTAL-PROCESADOS PIC 9(03) VALUE ZEROES.

      *VARIABLE PARA CALCULOS
        01 WS-SUELDO-CALCULADO PIC 9(06)V99 VALUE ZEROES.

      *VARIABLES PARA QUE EL DINERO SE VEA BIEN (MASCARAS)
        01 SALIDA-SALARIO PIC $Z,ZZ9.99.
        01 SALIDA-SUELDO PIC $ZZ,ZZ9.99.

        01 WS-SUMA-TOTAL-SUELDOS PIC 9(08)V99 VALUE ZEROES.
        01 SALIDA-SUMA-TOTAL PIC $$$,$$$,$$9.99.
       PROCEDURE DIVISION.
        000-PRINCIPAL.
       PERFORM 100-ABRIR-ARCHIVO

      *BUCLE ESTANDAR HASTA QUE LA BANDERA CAMBIE A "S"
       PERFORM 200-PROCESAR-REGISTROS UNTIL WS-FIN-ARCHIVO="S"

       PERFORM 300-CERRAR-ARCHIVO
       STOP RUN.

       100-ABRIR-ARCHIVO.
       OPEN INPUT ARCHIVO-EMPLEADOS
       DISPLAY "REPORTE DE NOMINA DE EMPLEADOS"

       READ ARCHIVO-EMPLEADOS
       AT END
       MOVE "S" TO WS-FIN-ARCHIVO
       NOT AT END
       ADD 1 TO WS-TOTAL-LEIDOS
       END-READ.

       200-PROCESAR-REGISTROS.
      *CALCULO DEL SUELDO
       COMPUTE WS-SUELDO-CALCULADO = EMP-SALARIO-DIA * EMP-DIAS-TRAB

      *MANDAR A VARIABLES CON FORMATO
       MOVE EMP-SALARIO-DIA TO SALIDA-SALARIO
       MOVE WS-SUELDO-CALCULADO TO SALIDA-SUELDO

      *IMPRIMIR EL REPORTE DEL EMPLEADO
       DISPLAY "EMPLEADO : " EMP-NOMBRE EMP-AP-PATERNO
       DISPLAY "UNIVERSIDAD : " EMP-UNI
       DISPLAY "PROFESION : " EMP-PROFESION
       DISPLAY "EXPERIENCIA : " EMP-EXPERIENCIA "AÑOS"
       DISPLAY "SALARIO DIARIO : " SALIDA-SALARIO
       DISPLAY "DIAS TRABAJADOS : " EMP-DIAS-TRAB
       DISPLAY "SUELDO TOTAL : " SALIDA-SUELDO

       ADD 1 TO WS-TOTAL-PROCESADOS

      *4. LEER EL SIGUIENTE REGISTRO
       READ ARCHIVO-EMPLEADOS
       AT END
       MOVE "S" TO WS-FIN-ARCHIVO
       NOT AT END
       ADD 1 TO WS-TOTAL-LEIDOS
       END-READ.

       300-CERRAR-ARCHIVO.
       CLOSE ARCHIVO-EMPLEADOS
       DISPLAY "RESUMEN ESTADISTICO"
       DISPLAY "REGISTROS LEIDOS : " WS-TOTAL-LEIDOS
       DISPLAY "REGISTROS PROCESADOS : " WS-TOTAL-PROCESADOS.

       END PROGRAM REPORTE-NOMINA.
